Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/include/pic32ck1025gc01100.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M33 exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void MemoryManagement_Handler      ( void );
void BusFault_Handler              ( void );
void UsageFault_Handler            ( void );
void SecureFaultMonitor_Handler    ( void );
void SVCall_Handler                ( void );
void DebugMonitor_Handler          ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void FCR_ERR_Handler               ( void );
void FCR_FLT_Handler               ( void );
void FCW_Handler                   ( void );
void PM_Handler                    ( void );
void SUPC_Handler                  ( void );
void OSCCTRL_XOSC_Handler          ( void );
void OSCCTRL_DFLL_Handler          ( void );
void OSCCTRL_PLL0_Handler          ( void );
void OSC32KCTRL_Handler            ( void );
void MCLK_Handler                  ( void );
void FREQM_Handler                 ( void );
void WDT_Handler                   ( void );
void RTC_Handler                   ( void );
void EIC_EXTINT_0_Handler          ( void );
void EIC_EXTINT_1_Handler          ( void );
void EIC_EXTINT_2_Handler          ( void );
void EIC_EXTINT_3_Handler          ( void );
void EIC_EXTINT_4_Handler          ( void );
void EIC_EXTINT_5_Handler          ( void );
void EIC_EXTINT_6_Handler          ( void );
void EIC_EXTINT_7_Handler          ( void );
void EIC_EXTINT_8_Handler          ( void );
void EIC_EXTINT_9_Handler          ( void );
void EIC_EXTINT_10_Handler         ( void );
void EIC_EXTINT_11_Handler         ( void );
void EIC_EXTINT_12_Handler         ( void );
void EIC_EXTINT_13_Handler         ( void );
void EIC_EXTINT_14_Handler         ( void );
void EIC_EXTINT_15_Handler         ( void );
void EIC_NSCHK_Handler             ( void );
void PAC_Handler                   ( void );
void TRAM_Handler                  ( void );
void PORT_Handler                  ( void );
void DMA0_PRI0_Handler             ( void );
void DMA0_PRI1_Handler             ( void );
void DMA0_PRI2_Handler             ( void );
void DMA1_PRI0_Handler             ( void );
void DMA1_PRI1_Handler             ( void );
void HMATRIX_Handler               ( void );
void EVSYS_0_Handler               ( void );
void EVSYS_1_Handler               ( void );
void EVSYS_2_Handler               ( void );
void EVSYS_3_Handler               ( void );
void EVSYS_OTHER_Handler           ( void );
void SERCOM0_56_Handler            ( void );
void SERCOM0_0_Handler             ( void );
void SERCOM0_1_Handler             ( void );
void SERCOM0_2_Handler             ( void );
void SERCOM0_3_Handler             ( void );
void SERCOM0_4_Handler             ( void );
void SERCOM1_56_Handler            ( void );
void SERCOM1_0_Handler             ( void );
void SERCOM1_1_Handler             ( void );
void SERCOM1_2_Handler             ( void );
void SERCOM1_3_Handler             ( void );
void SERCOM1_4_Handler             ( void );
void SERCOM2_56_Handler            ( void );
void SERCOM2_0_Handler             ( void );
void SERCOM2_1_Handler             ( void );
void SERCOM2_2_Handler             ( void );
void SERCOM2_3_Handler             ( void );
void SERCOM2_4_Handler             ( void );
void SERCOM3_56_Handler            ( void );
void SERCOM3_0_Handler             ( void );
void SERCOM3_1_Handler             ( void );
void SERCOM3_2_Handler             ( void );
void SERCOM3_3_Handler             ( void );
void SERCOM3_4_Handler             ( void );
void TCC0_OTHER_Handler            ( void );
void TCC0_MC_0_Handler             ( void );
void TCC0_MC_1_Handler             ( void );
void TCC0_MC_2_Handler             ( void );
void TCC0_MC_3_Handler             ( void );
void TCC0_MC_4_Handler             ( void );
void TCC0_MC_5_Handler             ( void );
void TCC1_OTHER_Handler            ( void );
void TCC1_MC_0_Handler             ( void );
void TCC1_MC_1_Handler             ( void );
void TCC1_MC_2_Handler             ( void );
void TCC1_MC_3_Handler             ( void );
void TCC1_MC_4_Handler             ( void );
void TCC1_MC_5_Handler             ( void );
void TCC2_OTHER_Handler            ( void );
void TCC2_MC_0_Handler             ( void );
void TCC2_MC_1_Handler             ( void );
void TCC2_MC_2_Handler             ( void );
void TCC2_MC_3_Handler             ( void );
void TCC2_MC_4_Handler             ( void );
void TCC2_MC_5_Handler             ( void );
void TCC3_OTHER_Handler            ( void );
void TCC3_MC_0_Handler             ( void );
void TCC3_MC_1_Handler             ( void );
void TCC3_MC_2_Handler             ( void );
void TCC3_MC_3_Handler             ( void );
void TCC3_MC_4_Handler             ( void );
void TCC3_MC_5_Handler             ( void );
void SERCOM4_56_Handler            ( void );
void SERCOM4_0_Handler             ( void );
void SERCOM4_1_Handler             ( void );
void SERCOM4_2_Handler             ( void );
void SERCOM4_3_Handler             ( void );
void SERCOM4_4_Handler             ( void );
void SERCOM5_56_Handler            ( void );
void SERCOM5_0_Handler             ( void );
void SERCOM5_1_Handler             ( void );
void SERCOM5_2_Handler             ( void );
void SERCOM5_3_Handler             ( void );
void SERCOM5_4_Handler             ( void );
void SERCOM6_56_Handler            ( void );
void SERCOM6_0_Handler             ( void );
void SERCOM6_1_Handler             ( void );
void SERCOM6_2_Handler             ( void );
void SERCOM6_3_Handler             ( void );
void SERCOM6_4_Handler             ( void );
void SERCOM7_56_Handler            ( void );
void SERCOM7_0_Handler             ( void );
void SERCOM7_1_Handler             ( void );
void SERCOM7_2_Handler             ( void );
void SERCOM7_3_Handler             ( void );
void SERCOM7_4_Handler             ( void );
void TCC4_OTHER_Handler            ( void );
void TCC4_MC_0_Handler             ( void );
void TCC4_MC_1_Handler             ( void );
void TCC5_OTHER_Handler            ( void );
void TCC5_MC_0_Handler             ( void );
void TCC5_MC_1_Handler             ( void );
void TCC6_OTHER_Handler            ( void );
void TCC6_MC_0_Handler             ( void );
void TCC6_MC_1_Handler             ( void );
void TCC7_OTHER_Handler            ( void );
void TCC7_MC_0_Handler             ( void );
void TCC7_MC_1_Handler             ( void );
void ADC_0_Handler                 ( void );
void ADC_1_Handler                 ( void );
void ADC_2_Handler                 ( void );
void ADC_3_Handler                 ( void );
void ADC_4_Handler                 ( void );
void ADC_5_Handler                 ( void );
void AC_Handler                    ( void );
void PTC_Handler                   ( void );
void SPI_IXS_Handler               ( void );
void PCC_Handler                   ( void );
void PDEC_Handler                  ( void );
void CAN0_Handler                  ( void );
void CAN1_Handler                  ( void );
void ETH_Handler                   ( void );
void SQI_Handler                   ( void );
void TRNG_Handler                  ( void );
void SDMMC0_Handler                ( void );
void SDMMC1_Handler                ( void );
void USB_OTHER_Handler             ( void );
void USB_SOF_Handler               ( void );
void USB_TRCPT0_Handler            ( void );
void USB_TRCPT1_Handler            ( void );
void USBHS_Handler                 ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M33 Processor and Core Peripherals */
#define __CM33_REV                    0x0000 /* Cortex-M33 Revision                                                       */
#define __DEBUG_LVL                        2 /* Debug Level                                                               */
#define __DSP_PRESENT                      1 /* DSP extension present or not                                              */
#define __FPU_PRESENT                      1 /* FPU present or not                                                        */
#define __MPU_PRESENT                      1 /* MPU present or not                                                        */
#define __NVIC_PRIO_BITS                   3 /* Number of NVIC Priority bits                                              */
#define __TRACE_LVL                        2 /* Trace Level                                                               */
#define __VTOR_PRESENT                     1 /* Vector Table Offset Register present or not                               */
#define __Vendor_SysTickConfig             0 /* Set to 1 if different SysTick Config is used                              */
#define __ARCH_ARM                         1
#define __ARCH_ARM_CORTEX_M                1

